{
  "navbar": {
    "home": "Home",
    "aboutMe": "About Me",
    "projects": "My Projects",
    "contact": "Contact",
    "getInTouch": "Get in Touch"
  },
  "header": {
    "name": "Alaa Mousa Hasan",
    "title": "DevOps & Monitoring Engineer",
    "description": "DevOps Engineer with strong hands-on experience in automation, monitoring, distributed systems, and cloud-native tooling. Skilled in Prometheus/Grafana, Docker/Kubernetes, CI/CD pipelines, and infrastructure automation across Windows and Linux environments. Passionate about building reliable systems and end-to-end automation.",
    "viewPortfolio": "View Portfolio",
    "getInTouch": "Get in Touch"
  },
  "about": {
    "title": "About Me",
    "subtitle": "DevOps & Service Engineer focused on automation, monitoring, and distributed systems.",
    "skills": {
      "title": "Skills",
      "programming": "Programming: Python, Bash, PowerShell, C#, JavaScript",
      "softwareTools": "Tools: Prometheus, Grafana, Alertmanager, Docker, Kubernetes, Terraform, Ansible, GitHub Actions, Proxmox",
      "frameworks": "Frameworks: ASP.NET Core, React, Node.js",
      "projectManagement": "Project Management: Agile, Jira, Confluence",
      "database": "Databases: PostgreSQL, SQLite, SQL",
      "languages": "Languages: English (fluent), German (fluent)",
      "details": {
        "testing": "Background in test automation and model-based workflows (Simulink, CANoe, CAPL).",
        "systems": "Experienced in distributed infrastructure and client-server architectures.",
        "modeling": "Academic background in signal processing and mathematical modeling (FFT/DFT, Laplace, Z-Transform)."
      },
      "readMore": "Show More",
      "readLess": "Show Less"
    },
    "experience": {
      "title": "Professional Experience",
      "swarco": {
        "title": "Swarco GmbH, Berlin",
        "duration": "DevOps & Monitoring Engineer (2024 – Present)",
        "details": {
          "1": "Designed, deployed, and maintained large-scale monitoring stacks (Prometheus, Grafana, Alertmanager) across 40+ traffic-control sites.",
          "2": "Automated system provisioning with Terraform, Ansible, and scripting (Bash/Python).",
          "3": "Developed dashboards, alert rules, exporters, and scraping architectures for distributed Windows/Linux systems.",
          "4": "Troubleshot infrastructure, network issues, and service outages across production environments.",
          "5": "Collaborated with internal teams, customer sites, and vendors to ensure system reliability and uptime."
        }
      },
      "otis": {
        "title": "Otis GmbH, Berlin",
        "duration": "Automation & System Testing Engineer (2022 – 2024)",
        "details": {
          "1": "Developed automated test workflows using Simulink, CANoe, and Python.",
          "2": "Improved CI/CD processes and build automation for testing systems.",
          "3": "Worked with distributed test environments, remote agents, and static code analysis tools.",
          "4": "Contributed to scalable automation frameworks used in system validation."
        }
      },
      "internationalMotivation": {
        "title": "International Motivation Training",
        "duration": "IT Support & Automation (2021 – 2022)",
        "details": {
          "1": "Provided IT support, troubleshooting, and system configuration.",
          "2": "Created small automation tools to optimize internal workflows.",
          "3": "Performed network setup, laptop configuration, and system maintenance."
        }
      },
      "4com": {
        "title": "4Com GmbH, Hannover",
        "duration": "Intern & Working Student (2019 – 2020)",
        "details": {
          "1": "Worked with JavaScript-based testing tools and Cypress.io.",
          "2": "Supported backend and internal tooling.",
          "3": "Collaborated with engineering teams to improve test reliability."
        }
      },
      "readMore": "Show More",
      "readLess": "Show Less"
    },
    "education": {
      "title": "Education",
      "master": {
        "title": "Master of Computer Engineering",
        "institution": "HTW Berlin (2022 – 2024)",
        "details": {
          "1": "Focused on embedded systems, automation, and distributed computing.",
          "2": "Completed advanced coursework in signal processing, modeling, and verification.",
          "3": "Completed robotics and automation projects using ROS2 and Simulink."
        }
      },
      "bachelor": {
        "title": "Bachelor of Electrical and Information Engineering",
        "institution": "Hochschule Hannover (2017 – 2022)",
        "details": {
          "1": "Studied electrotechnical systems and information processing.",
          "2": "Completed projects in automation, digital systems, and measurement technologies.",
          "3": "Bachelor’s thesis and internship in automation and advanced measurement systems."
        }
      }
    }
  },
  "projects": {
    "title": "Projects",
    "items": [
      {
        "name": "Prometheus & Grafana Monitoring Setup",
        "description": "Configured and maintained monitoring for 40+ distributed Windows/Linux systems. Managed VMs, deployed and supervised Dockerized services using Portainer, and integrated Prometheus, Grafana, and Windows/Linux exporters for full observability."
      },
      {
        "name": "B2B Supplier–Restaurant Platform",
        "description": "Designed and managed a full-stack .NET 8 + React platform. Defined business requirements, planned system architecture, created technical tasks, and implemented authentication, role management, and database models."
      },
      {
        "name": "Grafana Dashboards & Alert Rules",
        "description": "Developed advanced dashboards, variables, templates, and alerting rules for production monitoring across multiple sites."
      },
      {
        "name": "Investify – Micro-Investment Platform Concept",
        "description": "Designed the business and technical concept for a micro-investment platform. Defined requirements, investor flows, subscription model, and MVP roadmap with early market validation."
      },
      {
        "name": "Simulink Model Generator",
        "description": "Developed a parser and automation tool to generate Simulink models from structured Excel sheets to accelerate testing workflows."
      },
      {
        "name": "HIL Testing Automation",
        "description": "Automated system tests using CANoe, CAPL, Python, and Simulink, integrating them into validation workflows."
      },
      {
        "name": "Bamboo CI/CD Agent Setup",
        "description": "Configured and deployed Bamboo build agents for automated CI/CD pipelines supporting builds, tests, and validation stages."
      },
      {
  "name": "Network Debugging & Connectivity Troubleshooting",
  "description": "Analyzed and resolved network-related issues across distributed Windows/Linux systems. Debugged exporter connectivity, firewall restrictions, routing problems, unreachable VMs, and blocked ports. Used traceroute, telnet/netcat, logs, and jump-host access to diagnose and restore system communication."
},
      {
        "name": "Computer Vision Experiments",
        "description": "Developed early computer vision prototypes using Python and OpenCV, implementing edge detection, thresholding, and feature extraction."
      },
      {
        "name": "Python Automation Scripts",
        "description": "Built automation tools for scraping room availability, sending email alerts, and retrieving weather data via external APIs."
      },
      {
        "name": "Weather Forecast Application",
        "description": "Developed a Python application that fetches and displays real-time weather data using external API requests."
      },
      {
        "name": "Interactive Online CV Website",
        "description": "Built a responsive and multi-language online CV using React, reusable components, routing, animations, and i18n support."
      },
      {
        "name": "Multi-Device Communication System (Bachelor Project)",
        "description": "Developed a microcontroller-to-Android communication system using SPI and serial protocols, enabling synchronized data exchange between embedded hardware and mobile devices."
      },
      {
        "name": "Docker Compose Environment Setup",
        "description": "Created and managed Docker Compose environments for local development and testing. Structured multi-container setups for backend, frontend, databases, and monitoring services."
      },
      {
        "name": "Portainer Stack Deployment",
        "description": "Deployed and managed Docker containers through Portainer, including stack configurations, container upgrades, and monitoring for distributed systems."
      },
      {
        "name": "Kubernetes Deployment Demo",
        "description": "Deployed a frontend and backend application on Kubernetes using deployments, services, and namespaces. Tested scaling, service routing, and container orchestration on a K3s cluster."
      },
      {
        "name": "Terraform & Ansible Automation Lab",
        "description": "Created small infrastructure-as-code experiments using Terraform for provisioning and Ansible for configuration automation on Linux/Windows systems."
      }
    ]
  },
  "portfolio": {
  "title": "Portfolio",
  "hintText": "View full project list",
  "hintLink": "/myprojects",
  "items": [
    {
      "name": "Interactive Online Resume",
      "description": "A responsive web-based CV built using React, JS, and modular components.",
      "link": "https://github.com/AlaaMousaHasan/myCv"
    },
    {
      "name": "Monitoring Automation Scripts",
      "description": "Scripts for automating Prometheus exporters and service checks.",
      "link": "https://github.com/AlaaMousaHasan"
    },
    {
      "name": "Infrastructure-as-Code Lab",
      "description": "Terraform and Ansible automation for learning and production use cases.",
      "link": "https://github.com/AlaaMousaHasan"
    },
    {
      "name": "Legacy Python Projects",
      "description": "Early automation tools including weather forecasting, scraping, and email alerts.",
      "link": "https://github.com/AlaaMousaHasan"
    }
  ],
  "viewOnGithub": "View on GitHub"
},
  "contact": {
    "title": "Contact Me",
    "subtitle": "Feel free to reach out for opportunities, collaboration, or technical discussions.",
    "formTitle": "Send a Message",
    "form": {
      "name": "Name",
      "namePlaceholder": "Your Name",
      "email": "Email",
      "emailPlaceholder": "Your Email",
      "subject": "Subject",
      "subjectPlaceholder": "Subject",
      "message": "Message",
      "messagePlaceholder": "Your Message",
      "submit": "Submit"
    },
    "infoTitle": "Contact Information",
    "info": {
      "email": "alaamousahassan@gmail.com",
      "phone": "+49 15755280469",
      "address": "Berlin, Germany"
    }
  }
}